Revit 2026 API

# RebarHandleNameData Properties

---

The RebarHandleNameData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarHandleNameData Class

Autodesk.Revit.DB.Structure Namespace